Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.AnalyticalCurvedPanelNotValid Property
 Analytical Curved Panel is not valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AnalyticalCurvedPanelNotValid { get; }
Public Shared ReadOnly Property AnalyticalCurvedPanelNotValid As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AnalyticalCurvedPanelNotValid {
	FailureDefinitionId^ get ();
}
static member AnalyticalCurvedPanelNotValid : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace